----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1             [-1, 64, 6, 7]           1,216
       BatchNorm2d-2             [-1, 64, 6, 7]             128
              ReLU-3             [-1, 64, 6, 7]               0
            Conv2d-4             [-1, 64, 6, 7]          36,928
       BatchNorm2d-5             [-1, 64, 6, 7]             128
              ReLU-6             [-1, 64, 6, 7]               0
            Conv2d-7             [-1, 64, 6, 7]          36,928
       BatchNorm2d-8             [-1, 64, 6, 7]             128
              ReLU-9             [-1, 64, 6, 7]               0
             ReLU-10             [-1, 64, 6, 7]               0
         ResBlock-11             [-1, 64, 6, 7]               0
           Conv2d-12             [-1, 64, 6, 7]          36,928
      BatchNorm2d-13             [-1, 64, 6, 7]             128
             ReLU-14             [-1, 64, 6, 7]               0
           Conv2d-15             [-1, 64, 6, 7]          36,928
      BatchNorm2d-16             [-1, 64, 6, 7]             128
             ReLU-17             [-1, 64, 6, 7]               0
             ReLU-18             [-1, 64, 6, 7]               0
         ResBlock-19             [-1, 64, 6, 7]               0
           Conv2d-20             [-1, 64, 6, 7]          36,928
      BatchNorm2d-21             [-1, 64, 6, 7]             128
             ReLU-22             [-1, 64, 6, 7]               0
           Conv2d-23             [-1, 64, 6, 7]          36,928
      BatchNorm2d-24             [-1, 64, 6, 7]             128
             ReLU-25             [-1, 64, 6, 7]               0
             ReLU-26             [-1, 64, 6, 7]               0
         ResBlock-27             [-1, 64, 6, 7]               0
           Conv2d-28             [-1, 64, 6, 7]          36,928
      BatchNorm2d-29             [-1, 64, 6, 7]             128
             ReLU-30             [-1, 64, 6, 7]               0
           Conv2d-31             [-1, 64, 6, 7]          36,928
      BatchNorm2d-32             [-1, 64, 6, 7]             128
             ReLU-33             [-1, 64, 6, 7]               0
             ReLU-34             [-1, 64, 6, 7]               0
         ResBlock-35             [-1, 64, 6, 7]               0
           Conv2d-36             [-1, 64, 6, 7]          36,928
      BatchNorm2d-37             [-1, 64, 6, 7]             128
             ReLU-38             [-1, 64, 6, 7]               0
           Conv2d-39             [-1, 64, 6, 7]          36,928
      BatchNorm2d-40             [-1, 64, 6, 7]             128
             ReLU-41             [-1, 64, 6, 7]               0
             ReLU-42             [-1, 64, 6, 7]               0
         ResBlock-43             [-1, 64, 6, 7]               0
           Conv2d-44             [-1, 64, 6, 7]          36,928
      BatchNorm2d-45             [-1, 64, 6, 7]             128
             ReLU-46             [-1, 64, 6, 7]               0
           Conv2d-47             [-1, 64, 6, 7]          36,928
      BatchNorm2d-48             [-1, 64, 6, 7]             128
             ReLU-49             [-1, 64, 6, 7]               0
             ReLU-50             [-1, 64, 6, 7]               0
         ResBlock-51             [-1, 64, 6, 7]               0
           Conv2d-52             [-1, 64, 6, 7]          36,928
      BatchNorm2d-53             [-1, 64, 6, 7]             128
             ReLU-54             [-1, 64, 6, 7]               0
           Conv2d-55             [-1, 64, 6, 7]          36,928
      BatchNorm2d-56             [-1, 64, 6, 7]             128
             ReLU-57             [-1, 64, 6, 7]               0
             ReLU-58             [-1, 64, 6, 7]               0
         ResBlock-59             [-1, 64, 6, 7]               0
           Conv2d-60             [-1, 64, 6, 7]          36,928
      BatchNorm2d-61             [-1, 64, 6, 7]             128
             ReLU-62             [-1, 64, 6, 7]               0
           Conv2d-63             [-1, 64, 6, 7]          36,928
      BatchNorm2d-64             [-1, 64, 6, 7]             128
             ReLU-65             [-1, 64, 6, 7]               0
             ReLU-66             [-1, 64, 6, 7]               0
         ResBlock-67             [-1, 64, 6, 7]               0
           Conv2d-68             [-1, 64, 6, 7]          36,928
      BatchNorm2d-69             [-1, 64, 6, 7]             128
             ReLU-70             [-1, 64, 6, 7]               0
           Conv2d-71             [-1, 64, 6, 7]          36,928
      BatchNorm2d-72             [-1, 64, 6, 7]             128
             ReLU-73             [-1, 64, 6, 7]               0
             ReLU-74             [-1, 64, 6, 7]               0
         ResBlock-75             [-1, 64, 6, 7]               0
           Conv2d-76             [-1, 64, 6, 7]          36,928
      BatchNorm2d-77             [-1, 64, 6, 7]             128
             ReLU-78             [-1, 64, 6, 7]               0
           Conv2d-79             [-1, 64, 6, 7]          36,928
      BatchNorm2d-80             [-1, 64, 6, 7]             128
             ReLU-81             [-1, 64, 6, 7]               0
             ReLU-82             [-1, 64, 6, 7]               0
         ResBlock-83             [-1, 64, 6, 7]               0
           Conv2d-84             [-1, 64, 6, 7]          36,928
      BatchNorm2d-85             [-1, 64, 6, 7]             128
             ReLU-86             [-1, 64, 6, 7]               0
           Conv2d-87             [-1, 64, 6, 7]          36,928
      BatchNorm2d-88             [-1, 64, 6, 7]             128
             ReLU-89             [-1, 64, 6, 7]               0
             ReLU-90             [-1, 64, 6, 7]               0
         ResBlock-91             [-1, 64, 6, 7]               0
           Conv2d-92              [-1, 2, 6, 7]             130
      BatchNorm2d-93              [-1, 2, 6, 7]               4
             ReLU-94              [-1, 2, 6, 7]               0
          Flatten-95                   [-1, 84]               0
           Linear-96                    [-1, 7]             595
           Conv2d-97              [-1, 1, 6, 7]              65
      BatchNorm2d-98              [-1, 1, 6, 7]               2
             ReLU-99              [-1, 1, 6, 7]               0
         Flatten-100                   [-1, 42]               0
          Linear-101                    [-1, 1]              43
            Tanh-102                    [-1, 1]               0
================================================================
Total params: 817,415
Trainable params: 817,415
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 1.87
Params size (MB): 3.12
Estimated Total Size (MB): 4.99
----------------------------------------------------------------
None
